import styles from "./mission.module.scss";

export default function Mission() {
    const like = (
        <div style={{ width: 30 }}>
            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth={2} stroke="#FF8056" className="size-6">
                <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="M6.633 10.25c.806 0 1.533-.446 2.031-1.08a9.041 9.041 0 0 1 2.861-2.4c.723-.384 1.35-.956 1.653-1.715a4.498 4.498 0 0 0 .322-1.672V2.75a.75.75 0 0 1 .75-.75 2.25 2.25 0 0 1 2.25 2.25c0 1.152-.26 2.243-.723 3.218-.266.558.107 1.282.725 1.282m0 0h3.126c1.026 0 1.945.694 2.054 1.715.045.422.068.85.068 1.285a11.95 11.95 0 0 1-2.649 7.521c-.388.482-.987.729-1.605.729H13.48c-.483 0-.964-.078-1.423-.23l-3.114-1.04a4.501 4.501 0 0 0-1.423-.23H5.904m10.598-9.75H14.25M5.904 18.5c.083.205.173.405.27.602.197.4-.078.898-.523.898h-.908c-.889 0-1.713-.518-1.972-1.368a12 12 0 0 1-.521-3.507c0-1.553.295-3.036.831-4.398C3.387 9.953 4.167 9.5 5 9.5h1.053c.472 0 .745.556.5.96a8.958 8.958 0 0 0-1.302 4.665c0 1.194.232 2.333.654 3.375Z"
                />
            </svg>
        </div>
    );

    const light = (
        <div style={{ width: 30 }}>
            <svg xmlns="http://www.w3.org/2000/svg" fill="yellow" viewBox="0 0 24 24" strokeWidth={1.5} stroke="currentColor" className="size-6">
                <path strokeLinecap="round" strokeLinejoin="round" d="M12 18v-5.25m0 0a6.01 6.01 0 0 0 1.5-.189m-1.5.189a6.01 6.01 0 0 1-1.5-.189m3.75 7.478a12.06 12.06 0 0 1-4.5 0m3.75 2.383a14.406 14.406 0 0 1-3 0M14.25 18v-.192c0-.983.658-1.823 1.508-2.316a7.5 7.5 0 1 0-7.517 0c.85.493 1.509 1.333 1.509 2.316V18" />
            </svg>
        </div>
    );

    const flag = (
        <div style={{ width: 30 }}>
            <svg xmlns="http://www.w3.org/2000/svg" fill="#FF8056" viewBox="0 0 24 24" strokeWidth={1.5} stroke="currentColor" className="size-6">
                <path strokeLinecap="round" strokeLinejoin="round" d="M3 3v1.5M3 21v-6m0 0 2.77-.693a9 9 0 0 1 6.208.682l.108.054a9 9 0 0 0 6.086.71l3.114-.732a48.524 48.524 0 0 1-.005-10.499l-3.11.732a9 9 0 0 1-6.085-.711l-.108-.054a9 9 0 0 0-6.208-.682L3 4.5M3 15V4.5" />
            </svg>
        </div>
    );

    return (
        <div className={styles.missionWrap}>
            <h2>{flag}Миссия Компании: </h2>
            <h1>Обеспечиваем легкий доступ к качественным автотоварам в любое время в любом месте</h1>
            <h2>{light}Замысел:</h2>
            <ol>
                <li>
                    {like}
                    <span>
                        <b>1</b> Дистрибуция качественных автотоваров в широком ассортименте с возможностью онлайн заказа и доставкой в любую точку в течение 24 часов.
                    </span>
                </li>
                <li>
                    {like}
                    <span>
                        <b>2</b>Профессионально и быстро решить запросы клиента.
                    </span>
                </li>
                <li>
                    {like}
                    <span>
                        <b>3</b>Построение удобного, простого и понятного онлайн-сервиса, который уберет все проблемы и заботы обслуживания авто, покупки и подбора автотовара.
                    </span>
                </li>
            </ol>
        </div>
    );
}
